stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
        } else if (inputBuffer == "config") {
          Serial.println("=== Configuration ===");
          Serial.println("IP: " + String(espData.wifi.ips[0]) + "." + String(espData.wifi.ips[1]) + "." + String(espData.wifi.ips[2]) + "." + String(espData.wifi.ips[3]));
          Serial.println("GPS Source: " + String(espData.gps.externalGPS ? "Wireless" : "On-board"));
          Serial.println("GPS Output: " + String(espData.gps.ntripPandaMode ? "PANDA Generation" : "Raw NMEA Forwarding"));
          Serial.println("WAS Source: " + String(espData.steer.wirelessWAS ? "Wireless" : "Wired"));
          Serial.println("Use ADS: " + String(espData.steer.useADS ? "Yes" : "No"));
          Serial.println("LED Brightness: " + String(espData.program.ledBrht));
          Serial.println("PID Kp: " + String(espData.steer.gainP));
          Serial.println("====================");
          
        } else if (inputBuffer == "gps raw") {
          Serial.println("SERIAL COMMAND: Setting GPS to raw NMEA forwarding mode");
          espData.gps.ntripPandaMode = false;
          espData.saveConfig();
          Serial.println("GPS output set to: Raw NMEA Forwarding");
          Serial.println("GPS GGA/VTG sentences will be forwarded as-is via UDP");
          
        } else if (inputBuffer == "gps panda") {
          Serial.println("SERIAL COMMAND: Setting GPS to PANDA generation mode");
          espData.gps.ntripPandaMode = true;
          espData.saveConfig();
          Serial.println("GPS output set to: PANDA Generation");
          Serial.println("GPS GGA/VTG sentences will be parsed to generate PANDA messages");
          
        } else if (inputBuffer.length() > 0) {
          Serial.println("Unknown command: " + inputBuffer);
          Serial.println("Type 'help' for available commands");
        }
        
        inputBuffer = "";
        Serial.print("> "); // Command prompt
      }
    } else if (c >= 32 && c <= 126) { // Printable characters only
      inputBuffer += c;
      Serial.print(c); // Echo character
    }
  }
}

/**
 * @brief Outputs basic system debug information to serial console
 * 
 * @details This function prints essential system status to the serial interface:
 *          - Current timestamp (milliseconds since boot)
 *          - Program name and current operational state
 *          - Steering angle and target steering values
 *          - WiFi connection status and assigned IP address
 * 
 *          Uses tab-separated format for easy parsing and debugging.
 *          Called periodically for monitoring system operation.
 * 
 * @note Less detailed than status command output, optimized for frequent calls
 * @see handleSerialCommands()
 */
void debugPrint(){
  webSerial("Timestamp: " + String(millis()) + "\n");
  webSerial("\tprogName: " + String(NAME));
  webSerial("\tprogState: " + String(espData.program.state));
  webSerial("\tconfRes: " + String(espData.program.confRes));
  webSerial("\twifiRes: " + String(espData.wifi.state));
  webSerial("\tgpsFix: " + String(espData.gps.fixQualityInt));
  webSerial("\tip: " + String(espData.wifi.ips[0]) + "." + 
                     String(espData.wifi.ips[1]) + "." + 
                     String(espData.wifi.ips[2]) + "." + 
                     String(espData.wifi.ips[3]) + "\n");
  // webSerial("\timu roll: " + String(espData.gps.imuRoll) + 
  //           "\timu pitch: " + String(espData.gps.imuPitch) + 
  //           "\timu yaw: " + String(espData.gps.imuHeading) + "\n");
}

#pragma region Setup and Loop
/**
 * @brief Initializes the system in recovery mode with AP WiFi and basic web interface
 * 
 * @details Recovery mode provides emergency access when normal boot fails:
 *          - Creates WiFi Access Point "ESP32_AIO_RECOVERY" with password "recovery123"
 *          - Sets up minimal web server on 192.168.4.1 for configuration access
 *          - Loads recovery-specific debug variables for system diagnostics
 *          - Provides file system access for configuration recovery
 *          - Enables serial command interface for remote management
 * 
 *          This mode bypasses normal hardware initialization and network connection,
 *          allowing system recovery when configuration is corrupted or unreachable.
 * 
 * @note Only essential services are started to minimize resource usage
 * @see normalboot(), setup()
 */
void recoveryBoot() {
  Serial.println("=== ENTERING RECOVERY MODE ===");
  
  // Set all LEDs to error flash pattern to indicate recovery mode
  // I2CManager::getInstance().setAllLEDs(LEDPattern::ERROR_FLASH);
  
  // Initialize LittleFS for file operations
  Serial.println("Initializing LittleFS...");
  if (!LittleFS.begin(true)) {
    Serial.println("LittleFS Mount Failed - Attempting to format...");
    // if (LittleFS.format()) {
    //   Serial.println("LittleFS Format successful");
    //   if (LittleFS.begin(true)) {
    //     Serial.println("LittleFS Mount successful after format");
    //   } else {
    //     Serial.println("ERROR: LittleFS Mount failed even after format!");
    //   }
    // } else {
      // Serial.println("ERROR: LittleFS Format failed!");
    // }
  } else {
    Serial.println("LittleFS Mount successful");
  }
  
  // Verify file system is working
  Serial.printf("LittleFS Total: %u bytes\n", LittleFS.totalBytes());
  Serial.printf("LittleFS Used: %u bytes\n", LittleFS.usedBytes());
  
  // Setup WiFi AP for recovery access
  String recoverySSID = String(NAME) + "_RECOVERY";
  const char* recoveryPassword = "recovery123";
  
  Serial.println("Setting up Recovery WiFi AP...");
  Serial.println("SSID: " + recoverySSID);
  Serial.println("Password: " + String(recoveryPassword));
  
  WiFi.mode(WIFI_AP);
  WiFi.softAP(recoverySSID.c_str(), recoveryPassword);
  
  // Configure AP IP address
  IPAddress local_IP(192, 168, 1, 1);
  IPAddress gateway(192, 168, 1, 1);
  IPAddress subnet(255, 255, 255, 0);
  WiFi.softAPConfig(local_IP, gateway, subnet);
  espData.wifi.ips[0] = 192;
  espData.wifi.ips[1] = 168;
  espData.wifi.ips[2] = 1;
  espData.wifi.ips[3] = 1;
  
