stevennolte/Module_Firmware/ESP32_AIO/src/main.cpp
    // Try to reconnect or switch to AP mode
    if (espData.wifi.state == 1) {
      Serial.println("Forcing AP mode due to invalid network state");
      espData.wifi.state = espWifi.makeAP();
      delay(3000); // Give AP mode time to start
    }
    
    // Check again after fix attempt
    Serial.println("After fix attempt:");
    Serial.println("WiFi Status: " + String(WiFi.status()));
    Serial.println("WiFi Mode: " + String(WiFi.getMode()));
    Serial.println("IP Address: " + WiFi.localIP().toString());
  }
  
  // Wait for network stack to stabilize
  Serial.println("Waiting for network stack to stabilize...");
  delay(3000); // Increased delay for stability
  
  // Final verification before starting UDP
  Serial.println("Final network check before UDP:");
  Serial.println("WiFi Status: " + String(WiFi.status()));
  Serial.println("IP Address: " + WiFi.localIP().toString());
  
  // START UDP SERVICES FIRST - before other components try to use them
  Serial.println("=== STARTING UDP SERVICES ===");
  espUdp.begin(&gps);  // Initialize UDP services first
  Serial.println("=== UDP SERVICES COMPLETE ===");
  
  // Now start other components that depend on UDP
  Serial.println("Starting hardware tasks...");
  mainPower.startTask();

  Serial.println("Initializing GPS...");
  gps.init(&espUdp);  // Now UDP is ready
  
  Serial.println("Initializing steering...");
  espSteer.begin(&espUdp);  // Now UDP is ready
  
  
  // UDP setup
  Serial.println("Network setup complete");
  // delay(5000);
  
  #pragma region Server Setup
        // Serve the main HTML page
        server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
          Serial.println("Getting index file");
          if (LittleFS.exists("/index.html")) {
            request->send(LittleFS, "/index.html");
          } else {
            Serial.println("ERROR: index.html not found in LittleFS");
            request->send(404, "text/plain", "index.html not found - file system may not be uploaded");
          }
        });
        // Route to get debug variables as JSON
        server.on("/getDebugVars", HTTP_GET, handleDebugVars);
        
        // Route to set debug mode (minimal vs full)
        server.on("/setDebugMode", HTTP_POST, [](AsyncWebServerRequest *request) {}, NULL, [](AsyncWebServerRequest *request, uint8_t *data, size_t len, size_t index, size_t total) {
          // This is the body handler for POST requests
          static String body = "";
          
          // Accumulate the body data
          if (index == 0) {
            body = "";  // Reset for new request
          }
          
          for (size_t i = 0; i < len; i++) {
            body += (char)data[i];
          }
          
          // Process only when we have received all the data
          if (index + len == total) {
            Serial.println("setDebugMode endpoint called");
            Serial.println("Request body: " + body);
            
            // Parse JSON body
            StaticJsonDocument<200> doc;
            DeserializationError error = deserializeJson(doc, body);
            
            if (error) {
              Serial.println("JSON parsing error: " + String(error.c_str()));
              request->send(400, "text/plain", "Invalid JSON");
              return;
            }
            
            if (doc.containsKey("fullDebug")) {
              bool newMode = doc["fullDebug"].as<bool>();
              fullDebugMode = newMode;
              String response = fullDebugMode ? "Full debug mode enabled" : "Minimal debug mode enabled";
              Serial.println("Debug mode changed to: " + String(fullDebugMode ? "FULL" : "MINIMAL"));
              request->send(200, "text/plain", response);
            } else {
              Serial.println("Missing fullDebug parameter in JSON");
              request->send(400, "text/plain", "Missing fullDebug parameter");
            }
          }
        });
        
        // Route to list files as JSON
        Serial.println("Registering settings endpoints for normal mode...");
        server.on("/settings", HTTP_GET, handleSettingsPage);
        server.on("/getSettings", HTTP_GET, handleGetSettings);
        server.on("/saveSettings", HTTP_POST, handleSaveSettings);
        Serial.println("Settings endpoints registered: /settings, /getSettings, /saveSettings");
        server.on("/getFiles", HTTP_GET, handleFileList);
        // Route to download files
        server.on("/download", HTTP_GET, handleFileDownload);

        // Handle file upload
        server.on("/upload", HTTP_POST, [](AsyncWebServerRequest *request) {}, handleFileUpload);

        server.on("/update", HTTP_POST, [](AsyncWebServerRequest *request) {}, 
        handleFirmwareUpload);

        server.on("/reboot", HTTP_GET, handleReboot);
        
        // WebSocket handler for serial monitor
        // ws.onEvent(onWsEvent);
        // server.addHandler(&ws);
        
        // Serial monitor web page
        server.on("/serialmonitor", HTTP_GET, [](AsyncWebServerRequest *request){
            String html = R"(
<!DOCTYPE html>
<html>
<head>
    <title>ESP32-AIO Serial Monitor</title>
    <meta name='viewport' content='width=device-width, initial-scale=1'>
    <style>
        body { 
            font-family: 'Courier New', monospace; 
            margin: 0; 
            padding: 20px; 
            background-color: #1e1e1e; 
            color: #ffffff; 
        }
        .container { 
            max-width: 1200px; 
            margin: 0 auto; 
        }
        .header { 
            background: #333; 
            padding: 15px; 
            border-radius: 5px; 
            margin-bottom: 10px; 
            display: flex; 
            justify-content: space-between; 
            align-items: center; 
        }
        .status { 
            color: #00ff00; 
            font-weight: bold; 
        }
        .status.disconnected { 
            color: #ff0000; 
        }
        .terminal { 
            background: #000; 
            color: #00ff00; 
            padding: 15px; 
            border-radius: 5px; 
            height: 70vh; 
            overflow-y: auto; 
            font-size: 14px; 
            white-space: pre-wrap; 
            border: 2px solid #333; 
        }
        .controls { 
            margin: 10px 0; 
            display: flex; 
            gap: 10px; 
            align-items: center; 
            flex-wrap: wrap;
        }
        .button { 
            background: #0066cc; 
            color: white; 
            border: none; 
            padding: 8px 16px; 
            border-radius: 4px; 
            cursor: pointer; 
        }
        .button:hover { 
            background: #0052a3; 
        }
        .button.clear { 
            background: #cc6600; 
        }
        .button.clear:hover { 
            background: #b85500; 
        }
        .button.danger { 
            background: #cc0000; 
        }
        .button.danger:hover { 
            background: #990000; 
        }
        input[type="text"] { 
            flex: 1; 
            padding: 8px; 
            border: 1px solid #555; 
            border-radius: 4px; 
            background: #333; 
            color: white; 
            min-width: 200px;
        }
        .timestamp { 
            color: #888; 
            font-size: 12px; 
        }
        @media (max-width: 768px) {
            .header { flex-direction: column; align-items: stretch; }
            .controls { flex-direction: column; }
            input[type="text"] { min-width: auto; margin-bottom: 10px; }
        }
    </style>
</head>
<body>
    <div class='container'>
        <div class='header'>
            <h2>📡 ESP32-AIO Serial Monitor</h2>
            <div class='status' id='status'>Connecting...</div>
        </div>
        
        <div class='controls'>
            <input type='text' id='commandInput' placeholder='Enter command (clear, restart, status)...' onkeypress='handleKeyPress(event)'>
            <button class='button' onclick='sendCommand()'>Send</button>
            <button class='button clear' onclick='clearTerminal()'>Clear</button>
            <button class='button' onclick='reconnect()'>Reconnect</button>
            <button class='button' onclick='sendPredefinedCommand("status")'>Status</button>
            <button class='button danger' onclick='sendPredefinedCommand("restart")'>Restart ESP32</button>
        </div>
        
